7767517
1424 1762
SherpaMetaData           sherpa_meta_data1        0 0 0=2 1=32 2=4 3=7 -23316=5,2,2,2,2,2 -23317=5,256,256,256,256,256 -23318=5,192,192,192,192,192 -23319=5,1,2,4,8,2 -23320=5,31,31,31,31,31
Input                    in0                      0 1 in0
Input                    in1                      0 1 in1
Split                    splitncnn_0              1 2 in1 2 3
Input                    in2                      0 1 in2
Split                    splitncnn_1              1 2 in2 5 6
Input                    in3                      0 1 in3
Split                    splitncnn_2              1 2 in3 8 9
Input                    in4                      0 1 in4
Split                    splitncnn_3              1 2 in4 11 12
Input                    in5                      0 1 in5
Split                    splitncnn_4              1 2 in5 14 15
Input                    in6                      0 1 in6
Split                    splitncnn_5              1 2 in6 17 18
Input                    in7                      0 1 in7
Split                    splitncnn_6              1 2 in7 20 21
Input                    in8                      0 1 in8
Split                    splitncnn_7              1 2 in8 23 24
Input                    in9                      0 1 in9
Split                    splitncnn_8              1 2 in9 26 27
Input                    in10                     0 1 in10
Split                    splitncnn_9              1 2 in10 29 30
Input                    in11                     0 1 in11
Split                    splitncnn_10             1 2 in11 32 33
Input                    in12                     0 1 in12
Split                    splitncnn_11             1 2 in12 35 36
Input                    in13                     0 1 in13
Split                    splitncnn_12             1 2 in13 38 39
Input                    in14                     0 1 in14
Split                    splitncnn_13             1 2 in14 41 42
Input                    in15                     0 1 in15
Split                    splitncnn_14             1 2 in15 44 45
Input                    in16                     0 1 in16
Split                    splitncnn_15             1 2 in16 47 48
Input                    in17                     0 1 in17
Split                    splitncnn_16             1 2 in17 50 51
Input                    in18                     0 1 in18
Split                    splitncnn_17             1 2 in18 53 54
Input                    in19                     0 1 in19
Split                    splitncnn_18             1 2 in19 56 57
Input                    in20                     0 1 in20
Split                    splitncnn_19             1 2 in20 59 60
Input                    in21                     0 1 in21
Split                    splitncnn_20             1 2 in21 62 63
Input                    in22                     0 1 in22
Split                    splitncnn_21             1 2 in22 65 66
Input                    in23                     0 1 in23
Split                    splitncnn_22             1 2 in23 68 69
Input                    in24                     0 1 in24
Split                    splitncnn_23             1 2 in24 71 72
Input                    in25                     0 1 in25
Split                    splitncnn_24             1 2 in25 74 75
Input                    in26                     0 1 in26
Split                    splitncnn_25             1 2 in26 77 78
Input                    in27                     0 1 in27
Split                    splitncnn_26             1 2 in27 80 81
Input                    in28                     0 1 in28
Split                    splitncnn_27             1 2 in28 83 84
Input                    in29                     0 1 in29
Split                    splitncnn_28             1 2 in29 86 87
Input                    in30                     0 1 in30
Split                    splitncnn_29             1 2 in30 89 90
Input                    in31                     0 1 in31
Split                    splitncnn_30             1 2 in31 92 93
Input                    in32                     0 1 in32
Split                    splitncnn_31             1 2 in32 95 96
Input                    in33                     0 1 in33
Split                    splitncnn_32             1 2 in33 98 99
Input                    in34                     0 1 in34
Split                    splitncnn_33             1 2 in34 101 102
Input                    in35                     0 1 in35
Split                    splitncnn_34             1 2 in35 104 105
MemoryData               encoders.4.encoder.layers.1 0 1 106 0=1
MemoryData               encoders.4.encoder.layers.0 0 1 107 0=1
MemoryData               encoders.4.encoder.encoder_pos 0 1 108 0=256 1=47 2=1
Split                    splitncnn_35             1 2 108 109 110
MemoryData               encoders.3.encoder.layers.1 0 1 111 0=1
MemoryData               encoders.3.encoder.layers.0 0 1 112 0=1
MemoryData               encoders.3.encoder.encoder_pos 0 1 113 0=256 1=11 2=1
Split                    splitncnn_36             1 2 113 114 115
MemoryData               encoders.2.encoder.layers.1 0 1 116 0=1
MemoryData               encoders.2.encoder.layers.0 0 1 117 0=1
MemoryData               encoders.2.encoder.encoder_pos 0 1 118 0=256 1=23 2=1
Split                    splitncnn_37             1 2 118 119 120
MemoryData               encoders.1.encoder.layers.1 0 1 121 0=1
MemoryData               encoders.1.encoder.layers.0 0 1 122 0=1
MemoryData               encoders.1.encoder.encoder_pos 0 1 123 0=256 1=47 2=1
Split                    splitncnn_38             1 2 123 124 125
MemoryData               encoders.0.layers.1      0 1 126 0=1
MemoryData               encoders.0.layers.0      0 1 127 0=1
MemoryData               encoders.0.encoder_pos   0 1 128 0=256 1=95 2=1
Split                    splitncnn_39             1 2 128 129 130
ExpandDims               unsqueeze_501            1 1 in0 131 -23303=1,0
Convolution              conv_128                 1 1 131 132 0=8 1=3 11=3 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=72
Split                    splitncnn_40             1 2 132 133 134
BinaryOp                 sub_0                    1 1 133 135 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_20               1 1 135 136
BinaryOp                 mul_1                    2 1 134 136 137 0=2
Convolution              conv_129                 1 1 137 138 0=32 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=2304
Split                    splitncnn_41             1 2 138 139 140
BinaryOp                 sub_2                    1 1 139 141 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_21               1 1 141 142
BinaryOp                 mul_3                    2 1 140 142 143 0=2
Convolution              conv_130                 1 1 143 144 0=128 1=3 11=3 12=1 13=1 14=0 2=1 3=2 4=0 5=1 6=36864
Split                    splitncnn_42             1 2 144 145 146
BinaryOp                 sub_4                    1 1 145 147 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_22               1 1 147 148
BinaryOp                 mul_5                    2 1 146 148 149 0=2
Crop                     crop_592                 1 1 78 150 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  encoders.0.state_select_list.0_ncnnreshape0 1 1 150 151 0=0 1=0
Crop                     crop_593                 1 1 93 152 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_10_ncnnreshape0 1 1 152 153 0=0 1=0
Permute                  permute_448              1 1 149 154 0=2
Reshape                  reshape_252              1 1 154 155 0=2432 1=-1
InnerProduct             linear_131               1 1 155 156 0=256 1=1 2=622592
Split                    splitncnn_43             1 4 156 157 158 159 160
InnerProduct             linear_132               1 1 160 161 0=768 1=1 2=196608
Split                    splitncnn_44             1 2 161 162 163
BinaryOp                 sub_6                    1 1 162 164 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_23               1 1 164 165
BinaryOp                 mul_7                    2 1 163 165 166 0=2
InnerProduct             linear_133               1 1 166 167 0=256 1=1 2=196608
BinaryOp                 add_8                    2 1 157 167 168 0=0
Split                    splitncnn_45             1 2 168 169 170
Crop                     select_0                 1 1 18 171 -23310=1,1 -23311=1,0 -23309=1,0
Crop                     select_1                 1 1 3 172 -23310=1,1 -23311=1,0 -23309=1,0
PoolingModuleNoProj      pooling_modul_no_proj_502 3 3 170 172 171 173 174 175
InnerProduct             linear_134               1 1 173 176 0=256 1=0 2=65536
BinaryOp                 add_9                    2 1 169 176 177 0=0
Split                    splitncnn_46             1 2 177 178 179
Crop                     select_2                 1 1 33 180 -23310=1,1 -23311=1,0 -23309=1,0
Crop                     select_3                 1 1 48 181 -23310=1,1 -23311=1,0 -23309=1,0
InnerProduct             linear_135               1 1 179 182 0=496 1=1 2=126976
Slice                    tensor_split_0           1 4 182 183 184 185 186 -23300=4,192,192,96,-233 1=1
Concat                   cat_0                    2 1 181 185 187 0=0
Split                    splitncnn_47             1 2 187 188 189
Reshape                  reshape_253              1 1 188 190 0=24 1=4 2=80
Reshape                  reshape_254              1 1 183 191 0=48 1=4 2=16
Reshape                  reshape_255              1 1 186 192 0=4 1=4 2=16
Concat                   cat_1                    2 1 180 184 193 0=0
Split                    splitncnn_48             1 2 193 194 195
Reshape                  reshape_256              1 1 194 196 0=48 1=4 2=80
InnerProduct             linear_136               1 1 130 197 0=16 1=0 2=4096
Reshape                  reshape_257              1 1 197 198 0=4 1=4 2=95
Permute                  permute_516              1 1 198 199 0=3
Permute                  permute_514              1 1 192 200 0=2
MatMul                   matmul_418               2 1 200 199 201
Permute                  permute_515              1 1 196 202 0=3
Permute                  permute_513              1 1 191 203 0=2
MatMul                   matmul_419               2 1 203 202 204
TensorAsStrided          tensor_as_strided_612    1 1 201 205 -23300=3,4,16,80 -23301=3,1520,94,1 2=15
BinaryOp                 add_10                   2 1 204 205 206 0=0
Reshape                  view_388                 1 1 206 207 0=80 1=16 2=4
Softmax                  softmax_73               1 1 207 208 0=-1 1=1
Split                    splitncnn_49             1 2 208 209 210
Permute                  permute_512              1 1 190 211 0=2
MatMul                   bmm_398                  2 1 210 211 212
Permute                  permute_517              1 1 212 213 0=2
Reshape                  reshape_258              1 1 213 214 0=96 1=16
InnerProduct             linear_137               1 1 214 215 0=256 1=1 2=24576
BinaryOp                 add_11                   2 1 178 215 216 0=0
Split                    splitncnn_50             1 2 216 217 218
Permute                  permute_450              1 1 218 219 0=1
Convolution1D            conv1d_88                1 1 219 220 0=512 1=1 2=1 3=1 4=0 5=1 6=131072
GLU                      glu_0                    1 1 220 221 0=0
Concat                   cat_2                    2 1 151 221 222 0=1
Split                    splitncnn_51             1 2 222 223 224
ConvolutionDepthWise1D   convdw1d_631             1 1 224 225 0=256 1=31 2=1 3=1 4=0 5=1 6=7936 7=256
Split                    splitncnn_52             1 2 225 226 227
BinaryOp                 sub_12                   1 1 226 228 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_24               1 1 228 229
BinaryOp                 mul_13                   2 1 227 229 230 0=2
Convolution1D            conv1d_89                1 1 230 231 0=256 1=1 2=1 3=1 4=0 5=1 6=65536
Permute                  permute_451              1 1 231 232 0=1
BinaryOp                 add_14                   2 1 217 232 233 0=0
Split                    splitncnn_53             1 2 233 234 235
InnerProduct             linear_138               1 1 235 236 0=768 1=1 2=196608
Split                    splitncnn_54             1 2 236 237 238
BinaryOp                 sub_15                   1 1 237 239 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_25               1 1 239 240
BinaryOp                 mul_16                   2 1 238 240 241 0=2
InnerProduct             linear_139               1 1 241 242 0=256 1=1 2=196608
BinaryOp                 add_17                   2 1 234 242 243 0=0
Split                    splitncnn_55             1 2 243 244 245
Crop                     select_4                 1 1 63 246 -23310=1,1 -23311=1,0 -23309=1,0
InnerProduct             linear_140               1 1 245 247 0=96 1=0 2=24576
Concat                   cat_3                    2 1 246 247 248 0=0
Split                    splitncnn_56             1 2 248 249 250
Reshape                  reshape_259              1 1 249 251 0=24 1=4 2=80
Permute                  permute_518              1 1 251 252 0=2
MatMul                   bmm_399                  2 1 209 252 253
Permute                  permute_519              1 1 253 254 0=2
Reshape                  reshape_260              1 1 254 255 0=96 1=16
InnerProduct             linear_141               1 1 255 256 0=256 1=1 2=24576
BinaryOp                 add_18                   2 1 244 256 257 0=0
Split                    splitncnn_57             1 2 257 258 259
Permute                  permute_452              1 1 259 260 0=1
Convolution1D            conv1d_90                1 1 260 261 0=512 1=1 2=1 3=1 4=0 5=1 6=131072
GLU                      glu_1                    1 1 261 262 0=0
Concat                   cat_4                    2 1 153 262 263 0=1
Split                    splitncnn_58             1 2 263 264 265
ConvolutionDepthWise1D   convdw1d_632             1 1 265 266 0=256 1=31 2=1 3=1 4=0 5=1 6=7936 7=256
Split                    splitncnn_59             1 2 266 267 268
BinaryOp                 sub_19                   1 1 267 269 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_26               1 1 269 270
BinaryOp                 mul_20                   2 1 268 270 271 0=2
Convolution1D            conv1d_91                1 1 271 272 0=256 1=1 2=1 3=1 4=0 5=1 6=65536
Permute                  permute_453              1 1 272 273 0=1
BinaryOp                 add_21                   2 1 258 273 274 0=0
Split                    splitncnn_60             1 2 274 275 276
InnerProduct             linear_142               1 1 276 277 0=768 1=1 2=196608
Split                    splitncnn_61             1 2 277 278 279
BinaryOp                 sub_22                   1 1 278 280 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_27               1 1 280 281
BinaryOp                 mul_23                   2 1 279 281 282 0=2
InnerProduct             linear_143               1 1 282 283 0=256 1=1 2=196608
BinaryOp                 add_24                   2 1 275 283 284 0=0
Split                    splitncnn_62             1 3 284 285 286 287
BinaryOp                 mul_25                   2 1 285 286 288 0=2
Reduction                mean_438                 1 1 288 289 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_26                   1 1 289 290 0=0 1=1 2=6.432362e+00
BinaryOp                 pow_27                   1 1 290 291 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_28                   2 1 287 291 292 0=2
BinaryOp                 sub_29                   2 1 292 158 293 0=1
BinaryOp                 mul_30                   2 1 293 127 294 0=2
BinaryOp                 add_31                   2 1 159 294 295 0=0
Split                    splitncnn_63             1 4 295 296 297 298 299
Crop                     crop_594                 1 1 77 300 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  encoders.0.state_select_list.1_ncnnreshape0 1 1 300 301 0=0 1=0
Crop                     crop_595                 1 1 92 302 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_17_ncnnreshape0 1 1 302 303 0=0 1=0
InnerProduct             linear_144               1 1 299 304 0=768 1=1 2=196608
Split                    splitncnn_64             1 2 304 305 306
BinaryOp                 sub_32                   1 1 305 307 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_28               1 1 307 308
BinaryOp                 mul_33                   2 1 306 308 309 0=2
InnerProduct             linear_145               1 1 309 310 0=256 1=1 2=196608
BinaryOp                 add_34                   2 1 296 310 311 0=0
Split                    splitncnn_65             1 2 311 312 313
Crop                     select_5                 1 1 17 314 -23310=1,2 -23311=1,0 -23309=1,1
Crop                     select_6                 1 1 2 315 -23310=1,2 -23311=1,0 -23309=1,1
PoolingModuleNoProj      pooling_modul_no_proj_503 3 3 313 315 314 316 317 318
InnerProduct             linear_146               1 1 316 319 0=256 1=0 2=65536
BinaryOp                 add_35                   2 1 312 319 320 0=0
Split                    splitncnn_66             1 2 320 321 322
Crop                     select_7                 1 1 32 323 -23310=1,2 -23311=1,0 -23309=1,1
Crop                     select_8                 1 1 47 324 -23310=1,2 -23311=1,0 -23309=1,1
InnerProduct             linear_147               1 1 322 325 0=496 1=1 2=126976
Slice                    tensor_split_1           1 4 325 326 327 328 329 -23300=4,192,192,96,-233 1=1
Concat                   cat_5                    2 1 324 328 330 0=0
Split                    splitncnn_67             1 2 330 331 332
Reshape                  reshape_261              1 1 331 333 0=24 1=4 2=80
Reshape                  reshape_262              1 1 326 334 0=48 1=4 2=16
Reshape                  reshape_263              1 1 329 335 0=4 1=4 2=16
Concat                   cat_6                    2 1 323 327 336 0=0
Split                    splitncnn_68             1 2 336 337 338
Reshape                  reshape_264              1 1 337 339 0=48 1=4 2=80
InnerProduct             linear_148               1 1 129 340 0=16 1=0 2=4096
Reshape                  reshape_265              1 1 340 341 0=4 1=4 2=95
Permute                  permute_524              1 1 341 342 0=3
Permute                  permute_522              1 1 335 343 0=2
MatMul                   matmul_420               2 1 343 342 344
Permute                  permute_523              1 1 339 345 0=3
Permute                  permute_521              1 1 334 346 0=2
MatMul                   matmul_421               2 1 346 345 347
TensorAsStrided          tensor_as_strided_613    1 1 344 348 -23300=3,4,16,80 -23301=3,1520,94,1 2=15
BinaryOp                 add_36                   2 1 347 348 349 0=0
Reshape                  view_389                 1 1 349 350 0=80 1=16 2=4
Softmax                  softmax_74               1 1 350 351 0=-1 1=1
Split                    splitncnn_69             1 2 351 352 353
Permute                  permute_520              1 1 333 354 0=2
MatMul                   bmm_400                  2 1 353 354 355
Permute                  permute_525              1 1 355 356 0=2
Reshape                  reshape_266              1 1 356 357 0=96 1=16
InnerProduct             linear_149               1 1 357 358 0=256 1=1 2=24576
BinaryOp                 add_37                   2 1 321 358 359 0=0
Split                    splitncnn_70             1 2 359 360 361
Permute                  permute_454              1 1 361 362 0=1
Convolution1D            conv1d_92                1 1 362 363 0=512 1=1 2=1 3=1 4=0 5=1 6=131072
GLU                      glu_2                    1 1 363 364 0=0
Concat                   cat_7                    2 1 301 364 365 0=1
Split                    splitncnn_71             1 2 365 366 367
ConvolutionDepthWise1D   convdw1d_633             1 1 367 368 0=256 1=31 2=1 3=1 4=0 5=1 6=7936 7=256
Split                    splitncnn_72             1 2 368 369 370
BinaryOp                 sub_38                   1 1 369 371 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_29               1 1 371 372
BinaryOp                 mul_39                   2 1 370 372 373 0=2
Convolution1D            conv1d_93                1 1 373 374 0=256 1=1 2=1 3=1 4=0 5=1 6=65536
Permute                  permute_455              1 1 374 375 0=1
BinaryOp                 add_40                   2 1 360 375 376 0=0
Split                    splitncnn_73             1 2 376 377 378
InnerProduct             linear_150               1 1 378 379 0=768 1=1 2=196608
Split                    splitncnn_74             1 2 379 380 381
BinaryOp                 sub_41                   1 1 380 382 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_30               1 1 382 383
BinaryOp                 mul_42                   2 1 381 383 384 0=2
InnerProduct             linear_151               1 1 384 385 0=256 1=1 2=196608
BinaryOp                 add_43                   2 1 377 385 386 0=0
Split                    splitncnn_75             1 2 386 387 388
Crop                     select_9                 1 1 62 389 -23310=1,2 -23311=1,0 -23309=1,1
InnerProduct             linear_152               1 1 388 390 0=96 1=0 2=24576
Concat                   cat_8                    2 1 389 390 391 0=0
Split                    splitncnn_76             1 2 391 392 393
Reshape                  reshape_267              1 1 392 394 0=24 1=4 2=80
Permute                  permute_526              1 1 394 395 0=2
MatMul                   bmm_401                  2 1 352 395 396
Permute                  permute_527              1 1 396 397 0=2
Reshape                  reshape_268              1 1 397 398 0=96 1=16
InnerProduct             linear_153               1 1 398 399 0=256 1=1 2=24576
BinaryOp                 add_44                   2 1 387 399 400 0=0
Split                    splitncnn_77             1 2 400 401 402
Permute                  permute_456              1 1 402 403 0=1
Convolution1D            conv1d_94                1 1 403 404 0=512 1=1 2=1 3=1 4=0 5=1 6=131072
GLU                      glu_3                    1 1 404 405 0=0
Concat                   cat_9                    2 1 303 405 406 0=1
Split                    splitncnn_78             1 2 406 407 408
ConvolutionDepthWise1D   convdw1d_634             1 1 408 409 0=256 1=31 2=1 3=1 4=0 5=1 6=7936 7=256
Split                    splitncnn_79             1 2 409 410 411
BinaryOp                 sub_45                   1 1 410 412 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_31               1 1 412 413
BinaryOp                 mul_46                   2 1 411 413 414 0=2
Convolution1D            conv1d_95                1 1 414 415 0=256 1=1 2=1 3=1 4=0 5=1 6=65536
Permute                  permute_457              1 1 415 416 0=1
BinaryOp                 add_47                   2 1 401 416 417 0=0
Split                    splitncnn_80             1 2 417 418 419
InnerProduct             linear_154               1 1 419 420 0=768 1=1 2=196608
Split                    splitncnn_81             1 2 420 421 422
BinaryOp                 sub_48                   1 1 421 423 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_32               1 1 423 424
BinaryOp                 mul_49                   2 1 422 424 425 0=2
InnerProduct             linear_155               1 1 425 426 0=256 1=1 2=196608
BinaryOp                 add_50                   2 1 418 426 427 0=0
Split                    splitncnn_82             1 3 427 428 429 430
BinaryOp                 mul_51                   2 1 428 429 431 0=2
Reduction                mean_439                 1 1 431 432 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_52                   1 1 432 433 0=0 1=1 2=8.898914e+00
BinaryOp                 pow_53                   1 1 433 434 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_54                   2 1 430 434 435 0=2
BinaryOp                 sub_55                   2 1 435 297 436 0=1
BinaryOp                 mul_56                   2 1 436 126 437 0=2
BinaryOp                 add_57                   2 1 298 437 438 0=0
Split                    splitncnn_83             1 2 438 439 440
MemoryData               encoders.1.downsample    0 1 441 0=256 1=1 2=1
Reshape                  reshape_269              1 1 440 442 0=256 1=2 2=8
Split                    splitncnn_84             1 2 442 443 444
BinaryOp                 mul_58                   2 1 443 441 445 0=2
Reduction                sum_491                  1 1 445 446 0=0 1=0 -23303=1,-1 4=1 5=1
Softmax                  softmax_75               1 1 446 447 0=1 1=1
BinaryOp                 mul_59                   2 1 444 447 448 0=2
Reduction                sum_492                  1 1 448 449 0=0 1=0 -23303=1,1 4=0 5=1
Crop                     crop_596                 1 1 81 450 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  encoders.1.encoder.state_select_list.0_ncnnreshape0 1 1 450 451 0=0 1=0
Crop                     crop_597                 1 1 96 452 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_25_ncnnreshape0 1 1 452 453 0=0 1=0
Split                    splitncnn_85             1 4 449 454 455 456 457
InnerProduct             linear_156               1 1 457 458 0=768 1=1 2=196608
Split                    splitncnn_86             1 2 458 459 460
BinaryOp                 sub_60                   1 1 459 461 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_33               1 1 461 462
BinaryOp                 mul_61                   2 1 460 462 463 0=2
InnerProduct             linear_157               1 1 463 464 0=256 1=1 2=196608
BinaryOp                 add_62                   2 1 454 464 465 0=0
Split                    splitncnn_87             1 2 465 466 467
Crop                     select_10                1 1 21 468 -23310=1,1 -23311=1,0 -23309=1,0
Crop                     select_11                1 1 6 469 -23310=1,1 -23311=1,0 -23309=1,0
PoolingModuleNoProj      pooling_modul_no_proj_504 3 3 467 469 468 470 471 472
InnerProduct             linear_158               1 1 470 473 0=256 1=0 2=65536
BinaryOp                 add_63                   2 1 466 473 474 0=0
Split                    splitncnn_88             1 2 474 475 476
Crop                     select_12                1 1 36 477 -23310=1,1 -23311=1,0 -23309=1,0
Crop                     select_13                1 1 51 478 -23310=1,1 -23311=1,0 -23309=1,0
InnerProduct             linear_159               1 1 476 479 0=496 1=1 2=126976
Slice                    tensor_split_2           1 4 479 480 481 482 483 -23300=4,192,192,96,-233 1=1
Concat                   cat_10                   2 1 478 482 484 0=0
Split                    splitncnn_89             1 2 484 485 486
Reshape                  reshape_270              1 1 485 487 0=24 1=4 2=40
Reshape                  reshape_271              1 1 480 488 0=48 1=4 2=8
Reshape                  reshape_272              1 1 483 489 0=4 1=4 2=8
Concat                   cat_11                   2 1 477 481 490 0=0
Split                    splitncnn_90             1 2 490 491 492
Reshape                  reshape_273              1 1 491 493 0=48 1=4 2=40
InnerProduct             linear_160               1 1 125 494 0=16 1=0 2=4096
Reshape                  reshape_274              1 1 494 495 0=4 1=4 2=47
Permute                  permute_532              1 1 495 496 0=3
Permute                  permute_530              1 1 489 497 0=2
MatMul                   matmul_422               2 1 497 496 498
Permute                  permute_531              1 1 493 499 0=3
Permute                  permute_529              1 1 488 500 0=2
MatMul                   matmul_423               2 1 500 499 501
TensorAsStrided          tensor_as_strided_614    1 1 498 502 -23300=3,4,8,40 -23301=3,376,46,1 2=7
BinaryOp                 add_64                   2 1 501 502 503 0=0
Reshape                  view_390                 1 1 503 504 0=40 1=8 2=4
Softmax                  softmax_76               1 1 504 505 0=-1 1=1
Split                    splitncnn_91             1 2 505 506 507
Permute                  permute_528              1 1 487 508 0=2
MatMul                   bmm_402                  2 1 507 508 509
Permute                  permute_533              1 1 509 510 0=2
Reshape                  reshape_275              1 1 510 511 0=96 1=8
InnerProduct             linear_161               1 1 511 512 0=256 1=1 2=24576
BinaryOp                 add_65                   2 1 475 512 513 0=0
Split                    splitncnn_92             1 2 513 514 515
Permute                  permute_458              1 1 515 516 0=1
Convolution1D            conv1d_96                1 1 516 517 0=512 1=1 2=1 3=1 4=0 5=1 6=131072
GLU                      glu_4                    1 1 517 518 0=0
Concat                   cat_12                   2 1 451 518 519 0=1
Split                    splitncnn_93             1 2 519 520 521
ConvolutionDepthWise1D   convdw1d_635             1 1 521 522 0=256 1=31 2=1 3=1 4=0 5=1 6=7936 7=256
Split                    splitncnn_94             1 2 522 523 524
BinaryOp                 sub_66                   1 1 523 525 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_34               1 1 525 526
BinaryOp                 mul_67                   2 1 524 526 527 0=2
Convolution1D            conv1d_97                1 1 527 528 0=256 1=1 2=1 3=1 4=0 5=1 6=65536
Permute                  permute_459              1 1 528 529 0=1
BinaryOp                 add_68                   2 1 514 529 530 0=0
Split                    splitncnn_95             1 2 530 531 532
InnerProduct             linear_162               1 1 532 533 0=768 1=1 2=196608
Split                    splitncnn_96             1 2 533 534 535
BinaryOp                 sub_69                   1 1 534 536 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_35               1 1 536 537
BinaryOp                 mul_70                   2 1 535 537 538 0=2
InnerProduct             linear_163               1 1 538 539 0=256 1=1 2=196608
BinaryOp                 add_71                   2 1 531 539 540 0=0
Split                    splitncnn_97             1 2 540 541 542
Crop                     select_14                1 1 66 543 -23310=1,1 -23311=1,0 -23309=1,0
InnerProduct             linear_164               1 1 542 544 0=96 1=0 2=24576
Concat                   cat_13                   2 1 543 544 545 0=0
Split                    splitncnn_98             1 2 545 546 547
Reshape                  reshape_276              1 1 546 548 0=24 1=4 2=40
Permute                  permute_534              1 1 548 549 0=2
MatMul                   bmm_403                  2 1 506 549 550
Permute                  permute_535              1 1 550 551 0=2
Reshape                  reshape_277              1 1 551 552 0=96 1=8
InnerProduct             linear_165               1 1 552 553 0=256 1=1 2=24576
BinaryOp                 add_72                   2 1 541 553 554 0=0
Split                    splitncnn_99             1 2 554 555 556
Permute                  permute_460              1 1 556 557 0=1
Convolution1D            conv1d_98                1 1 557 558 0=512 1=1 2=1 3=1 4=0 5=1 6=131072
GLU                      glu_5                    1 1 558 559 0=0
Concat                   cat_14                   2 1 453 559 560 0=1
Split                    splitncnn_100            1 2 560 561 562
ConvolutionDepthWise1D   convdw1d_636             1 1 562 563 0=256 1=31 2=1 3=1 4=0 5=1 6=7936 7=256
Split                    splitncnn_101            1 2 563 564 565
BinaryOp                 sub_73                   1 1 564 566 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_36               1 1 566 567
BinaryOp                 mul_74                   2 1 565 567 568 0=2
Convolution1D            conv1d_99                1 1 568 569 0=256 1=1 2=1 3=1 4=0 5=1 6=65536
Permute                  permute_461              1 1 569 570 0=1
BinaryOp                 add_75                   2 1 555 570 571 0=0
Split                    splitncnn_102            1 2 571 572 573
InnerProduct             linear_166               1 1 573 574 0=768 1=1 2=196608
Split                    splitncnn_103            1 2 574 575 576
BinaryOp                 sub_76                   1 1 575 577 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_37               1 1 577 578
BinaryOp                 mul_77                   2 1 576 578 579 0=2
InnerProduct             linear_167               1 1 579 580 0=256 1=1 2=196608
BinaryOp                 add_78                   2 1 572 580 581 0=0
Split                    splitncnn_104            1 3 581 582 583 584
BinaryOp                 mul_79                   2 1 582 583 585 0=2
Reduction                mean_440                 1 1 585 586 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_80                   1 1 586 587 0=0 1=1 2=5.620271e+00
BinaryOp                 pow_81                   1 1 587 588 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_82                   2 1 584 588 589 0=2
BinaryOp                 sub_83                   2 1 589 455 590 0=1
BinaryOp                 mul_84                   2 1 590 122 591 0=2
BinaryOp                 add_85                   2 1 456 591 592 0=0
Split                    splitncnn_105            1 4 592 593 594 595 596
Crop                     crop_598                 1 1 80 597 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  encoders.1.encoder.state_select_list.1_ncnnreshape0 1 1 597 598 0=0 1=0
Crop                     crop_599                 1 1 95 599 -23310=1,2 -23311=1,0 -23309=1,1
Reshape                  pnnx_unique_33_ncnnreshape0 1 1 599 600 0=0 1=0
InnerProduct             linear_168               1 1 596 601 0=768 1=1 2=196608
Split                    splitncnn_106            1 2 601 602 603
BinaryOp                 sub_86                   1 1 602 604 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_38               1 1 604 605
BinaryOp                 mul_87                   2 1 603 605 606 0=2
InnerProduct             linear_169               1 1 606 607 0=256 1=1 2=196608
BinaryOp                 add_88                   2 1 593 607 608 0=0
Split                    splitncnn_107            1 2 608 609 610
Crop                     select_15                1 1 20 611 -23310=1,2 -23311=1,0 -23309=1,1
Crop                     select_16                1 1 5 612 -23310=1,2 -23311=1,0 -23309=1,1
PoolingModuleNoProj      pooling_modul_no_proj_505 3 3 610 612 611 613 614 615
InnerProduct             linear_170               1 1 613 616 0=256 1=0 2=65536
BinaryOp                 add_89                   2 1 609 616 617 0=0
Split                    splitncnn_108            1 2 617 618 619
Crop                     select_17                1 1 35 620 -23310=1,2 -23311=1,0 -23309=1,1
Crop                     select_18                1 1 50 621 -23310=1,2 -23311=1,0 -23309=1,1
InnerProduct             linear_171               1 1 619 622 0=496 1=1 2=126976
Slice                    tensor_split_3           1 4 622 623 624 625 626 -23300=4,192,192,96,-233 1=1
Concat                   cat_15                   2 1 621 625 627 0=0
Split                    splitncnn_109            1 2 627 628 629
Reshape                  reshape_278              1 1 628 630 0=24 1=4 2=40
Reshape                  reshape_279              1 1 623 631 0=48 1=4 2=8
Reshape                  reshape_280              1 1 626 632 0=4 1=4 2=8
Concat                   cat_16                   2 1 620 624 633 0=0
Split                    splitncnn_110            1 2 633 634 635
Reshape                  reshape_281              1 1 634 636 0=48 1=4 2=40
InnerProduct             linear_172               1 1 124 637 0=16 1=0 2=4096
Reshape                  reshape_282              1 1 637 638 0=4 1=4 2=47
Permute                  permute_540              1 1 638 639 0=3
Permute                  permute_538              1 1 632 640 0=2
MatMul                   matmul_424               2 1 640 639 641
Permute                  permute_539              1 1 636 642 0=3
Permute                  permute_537              1 1 631 643 0=2
MatMul                   matmul_425               2 1 643 642 644
TensorAsStrided          tensor_as_strided_615    1 1 641 645 -23300=3,4,8,40 -23301=3,376,46,1 2=7
BinaryOp                 add_90                   2 1 644 645 646 0=0
Reshape                  view_391                 1 1 646 647 0=40 1=8 2=4
Softmax                  softmax_77               1 1 647 648 0=-1 1=1
Split                    splitncnn_111            1 2 648 649 650
Permute                  permute_536              1 1 630 651 0=2
MatMul                   bmm_404                  2 1 650 651 652
Permute                  permute_541              1 1 652 653 0=2
Reshape                  reshape_283              1 1 653 654 0=96 1=8
InnerProduct             linear_173               1 1 654 655 0=256 1=1 2=24576
BinaryOp                 add_91                   2 1 618 655 656 0=0
Split                    splitncnn_112            1 2 656 657 658
Permute                  permute_462              1 1 658 659 0=1
Convolution1D            conv1d_100               1 1 659 660 0=512 1=1 2=1 3=1 4=0 5=1 6=131072
GLU                      glu_6                    1 1 660 661 0=0
Concat                   cat_17                   2 1 598 661 662 0=1
Split                    splitncnn_113            1 2 662 663 664
ConvolutionDepthWise1D   convdw1d_637             1 1 664 665 0=256 1=31 2=1 3=1 4=0 5=1 6=7936 7=256
Split                    splitncnn_114            1 2 665 666 667
BinaryOp                 sub_92                   1 1 666 668 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_39               1 1 668 669
BinaryOp                 mul_93                   2 1 667 669 670 0=2
Convolution1D            conv1d_101               1 1 670 671 0=256 1=1 2=1 3=1 4=0 5=1 6=65536
Permute                  permute_463              1 1 671 672 0=1
BinaryOp                 add_94                   2 1 657 672 673 0=0
Split                    splitncnn_115            1 2 673 674 675
InnerProduct             linear_174               1 1 675 676 0=768 1=1 2=196608
Split                    splitncnn_116            1 2 676 677 678
BinaryOp                 sub_95                   1 1 677 679 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_40               1 1 679 680
BinaryOp                 mul_96                   2 1 678 680 681 0=2
InnerProduct             linear_175               1 1 681 682 0=256 1=1 2=196608
BinaryOp                 add_97                   2 1 674 682 683 0=0
Split                    splitncnn_117            1 2 683 684 685
Crop                     select_19                1 1 65 686 -23310=1,2 -23311=1,0 -23309=1,1
InnerProduct             linear_176               1 1 685 687 0=96 1=0 2=24576
Concat                   cat_18                   2 1 686 687 688 0=0
Split                    splitncnn_118            1 2 688 689 690
Reshape                  reshape_284              1 1 689 691 0=24 1=4 2=40
Permute                  permute_542              1 1 691 692 0=2
MatMul                   bmm_405                  2 1 649 692 693
Permute                  permute_543              1 1 693 694 0=2
Reshape                  reshape_285              1 1 694 695 0=96 1=8
InnerProduct             linear_177               1 1 695 696 0=256 1=1 2=24576
BinaryOp                 add_98                   2 1 684 696 697 0=0
Split                    splitncnn_119            1 2 697 698 699
Permute                  permute_464              1 1 699 700 0=1
Convolution1D            conv1d_102               1 1 700 701 0=512 1=1 2=1 3=1 4=0 5=1 6=131072
GLU                      glu_7                    1 1 701 702 0=0
Concat                   cat_19                   2 1 600 702 703 0=1
Split                    splitncnn_120            1 2 703 704 705
ConvolutionDepthWise1D   convdw1d_638             1 1 705 706 0=256 1=31 2=1 3=1 4=0 5=1 6=7936 7=256
Split                    splitncnn_121            1 2 706 707 708
BinaryOp                 sub_99                   1 1 707 709 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_41               1 1 709 710
BinaryOp                 mul_100                  2 1 708 710 711 0=2
Convolution1D            conv1d_103               1 1 711 712 0=256 1=1 2=1 3=1 4=0 5=1 6=65536
Permute                  permute_465              1 1 712 713 0=1
BinaryOp                 add_101                  2 1 698 713 714 0=0
Split                    splitncnn_122            1 2 714 715 716
InnerProduct             linear_178               1 1 716 717 0=768 1=1 2=196608
Split                    splitncnn_123            1 2 717 718 719
BinaryOp                 sub_102                  1 1 718 720 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_42               1 1 720 721
BinaryOp                 mul_103                  2 1 719 721 722 0=2
InnerProduct             linear_179               1 1 722 723 0=256 1=1 2=196608
BinaryOp                 add_104                  2 1 715 723 724 0=0
Split                    splitncnn_124            1 3 724 725 726 727
BinaryOp                 mul_105                  2 1 725 726 728 0=2
Reduction                mean_441                 1 1 728 729 0=3 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 add_106                  1 1 729 730 0=0 1=1 2=1.053647e+01
BinaryOp                 pow_107                  1 1 730 731 0=6 1=1 2=-5.000000e-01
BinaryOp                 mul_108                  2 1 727 731 732 0=2
BinaryOp                 sub_109                  2 1 732 594 733 0=1
BinaryOp                 mul_110                  2 1 733 121 734 0=2
BinaryOp                 add_111                  2 1 595 734 735 0=0
MemoryData               encoders.1.out_combiner  0 1 736 0=1
Split                    splitncnn_125            1 2 736 737 738
BinaryOp                 sub_112                  1 1 737 739 0=7 1=1 2=1.000000e+00
SimpleUpsample           simple_upsample_627      1 1 735 740 0=2 1=256 2=512
BinaryOp                 mul_113                  2 1 740 739 741 0=2
BinaryOp                 mul_114                  2 1 439 738 742 0=2
BinaryOp                 add_115                  2 1 742 741 743 0=0
Split                    splitncnn_126            1 3 743 744 745 746
MemoryData               encoders.2.downsample    0 1 747 0=256 1=1 2=1
Reshape                  reshape_286              1 1 746 748 0=256 1=4 2=4
Split                    splitncnn_127            1 2 748 749 750
BinaryOp                 mul_116                  2 1 749 747 751 0=2
Reduction                sum_493                  1 1 751 752 0=0 1=0 -23303=1,-1 4=1 5=1
Softmax                  softmax_78               1 1 752 753 0=1 1=1
BinaryOp                 mul_117                  2 1 750 753 754 0=2
Reduction                sum_494                  1 1 754 755 0=0 1=0 -23303=1,1 4=0 5=1
Crop                     crop_600                 1 1 84 756 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  encoders.2.encoder.state_select_list.0_ncnnreshape0 1 1 756 757 0=0 1=0
Crop                     crop_601                 1 1 99 758 -23310=1,1 -23311=1,0 -23309=1,0
Reshape                  pnnx_unique_42_ncnnreshape0 1 1 758 759 0=0 1=0
Split                    splitncnn_128            1 4 755 760 761 762 763
InnerProduct             linear_180               1 1 763 764 0=768 1=1 2=196608
Split                    splitncnn_129            1 2 764 765 766
BinaryOp                 sub_118                  1 1 765 767 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_43               1 1 767 768
BinaryOp                 mul_119                  2 1 766 768 769 0=2
InnerProduct             linear_181               1 1 769 770 0=256 1=1 2=196608
BinaryOp                 add_120                  2 1 760 770 771 0=0
Split                    splitncnn_130            1 2 771 772 773
Crop                     select_20                1 1 24 774 -23310=1,1 -23311=1,0 -23309=1,0
Crop                     select_21                1 1 9 775 -23310=1,1 -23311=1,0 -23309=1,0
PoolingModuleNoProj      pooling_modul_no_proj_506 3 3 773 775 774 776 777 778
InnerProduct             linear_182               1 1 776 779 0=256 1=0 2=65536
BinaryOp                 add_121                  2 1 772 779 780 0=0
Split                    splitncnn_131            1 2 780 781 782
Crop                     select_22                1 1 39 783 -23310=1,1 -23311=1,0 -23309=1,0
Crop                     select_23                1 1 54 784 -23310=1,1 -23311=1,0 -23309=1,0
InnerProduct             linear_183               1 1 782 785 0=496 1=1 2=126976
Slice                    tensor_split_4           1 4 785 786 787 788 789 -23300=4,192,192,96,-233 1=1
Concat                   cat_20                   2 1 784 788 790 0=0
Split                    splitncnn_132            1 2 790 791 792
Reshape                  reshape_287              1 1 791 793 0=24 1=4 2=20
Reshape                  reshape_288              1 1 786 794 0=48 1=4 2=4
Reshape                  reshape_289              1 1 789 795 0=4 1=4 2=4
Concat                   cat_21                   2 1 783 787 796 0=0
Split                    splitncnn_133            1 2 796 797 798
Reshape                  reshape_290              1 1 797 799 0=48 1=4 2=20
InnerProduct             linear_184               1 1 120 800 0=16 1=0 2=4096
Reshape                  reshape_291              1 1 800 801 0=4 1=4 2=23
Permute                  permute_548              1 1 801 802 0=3
Permute                  permute_546              1 1 795 803 0=2
MatMul                   matmul_426               2 1 803 802 804
Permute                  permute_547              1 1 799 805 0=3
Permute                  permute_545              1 1 794 806 0=2
MatMul                   matmul_427               2 1 806 805 807
TensorAsStrided          tensor_as_strided_616    1 1 804 808 -23300=3,4,4,20 -23301=3,92,22,1 2=3
BinaryOp                 add_122                  2 1 807 808 809 0=0
Reshape                  view_392                 1 1 809 810 0=20 1=4 2=4
Softmax                  softmax_79               1 1 810 811 0=-1 1=1
Split                    splitncnn_134            1 2 811 812 813
Permute                  permute_544              1 1 793 814 0=2
MatMul                   bmm_406                  2 1 813 814 815
Permute                  permute_549              1 1 815 816 0=2
Reshape                  reshape_292              1 1 816 817 0=96 1=4
InnerProduct             linear_185               1 1 817 818 0=256 1=1 2=24576
BinaryOp                 add_123                  2 1 781 818 819 0=0
Split                    splitncnn_135            1 2 819 820 821
Permute                  permute_466              1 1 821 822 0=1
Convolution1D            conv1d_104               1 1 822 823 0=512 1=1 2=1 3=1 4=0 5=1 6=131072
GLU                      glu_8                    1 1 823 824 0=0
Concat                   cat_22                   2 1 757 824 825 0=1
Split                    splitncnn_136            1 2 825 826 827
ConvolutionDepthWise1D   convdw1d_639             1 1 827 828 0=256 1=31 2=1 3=1 4=0 5=1 6=7936 7=256
Split                    splitncnn_137            1 2 828 829 830
BinaryOp                 sub_124                  1 1 829 831 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_44               1 1 831 832
BinaryOp                 mul_125                  2 1 830 832 833 0=2
Convolution1D            conv1d_105               1 1 833 834 0=256 1=1 2=1 3=1 4=0 5=1 6=65536
Permute                  permute_467              1 1 834 835 0=1
BinaryOp                 add_126                  2 1 820 835 836 0=0
Split                    splitncnn_138            1 2 836 837 838
InnerProduct             linear_186               1 1 838 839 0=768 1=1 2=196608
Split                    splitncnn_139            1 2 839 840 841
BinaryOp                 sub_127                  1 1 840 842 0=1 1=1 2=1.000000e+00
Sigmoid                  sigmoid_45               1 1 842 843
BinaryOp                 mul_128                  2 1 841 843 844 0=2
InnerProduct             linear_187               1 1 844 845 0=256 1=1 2=196608
BinaryOp                 add_129                  2 1 837 845 846 0=0
Split                    splitncnn_140            1 2 846 847 848
Crop                     select_24                1 1 69 849 -23310=1,1 -23311=1,0 -23309=1,0
InnerProduct             linear_188               1 1 848 850 0=96 1=0 2=24576
Concat                   cat_23                   2 1 849 850 851 0=0
Split                    splitncnn_141            1 2 851 852 853
Reshape                  reshape_293              1 1 852 854 0=24 1=4 2=20
Permute                  permute_550              1 1 854 855 0=2
MatMul                   bmm_407                  2 1 812 855 856
Permute                  permute_551              1 1 856 857 0=2
Reshape                  reshape_294              1 1 857 858 0=96 1=4
InnerProduct             linear_189               1 1 858 859 0=256 1=1 2=24576
BinaryOp                 add_130                  2 1 847 859 860 0=0
